{
    "lang_fr": "Français",
    "lang_en": "English",
    "lang_es": "Español",
    "portal_button": "Portal",

    "hero_title": "Bienvenido a JEOAH\'S",
    "hero_subtitle": "JEOAH\'S es la plataforma todo en uno que conecta a vendedores, afiliados y compradores para un crecimiento explosivo. Lanza tu tienda, encuentra los mejores productos y maximiza tus ingresos.",
    "launch_offer_title": "¡Oferta Especial de Lanzamiento!",
    "launch_offer_text": "Los primeros 25 miembros obtienen beneficios exclusivos. ¡Únete ahora!",
    
    "features_title": "Una Plataforma, Tres Roles Clave",
    "features_subtitle": "Descubre cómo JEOAH\'S te ayuda a alcanzar tus objetivos, ya seas vendedor, afiliado o comprador.",
    "feature_sellers_title": "Para Vendedores",
    "feature_sellers_text": "Lanza tu tienda en pocos clics. Importa tus productos, gestiona tu inventario y sigue tus ventas desde un panel de control unificado. Llega a una nueva audiencia gracias a nuestra red de afiliados.",
    "feature_affiliates_title": "Para Afiliados",
    "feature_affiliates_text": "Monetiza tu audiencia. Accede a un catálogo de productos de calidad, genera tus enlaces de afiliado únicos y sigue tus comisiones en tiempo real. Herramientas sencillas para ingresos pasivos.",
    "feature_buyers_title": "Para Compradores",
    "feature_buyers_text": "Descubre y compra productos únicos y de calidad recomendados por creadores de confianza. Una experiencia de compra fluida, segura y centralizada.",
    
    "features_title_page": "Funcionalidades Clave",
    "features_subtitle_page": "Descubre todo lo que JEOAH\'S puede hacer por ti.",
    "feature_sellers_text_extended": "Lanza tu tienda en pocos clics. Sube tus productos (hasta 3 fotos por artículo), gestiona tu inventario y conecta tus redes sociales. Llega a una nueva audiencia a través de nuestra potente red de afiliados.",
    "feature_affiliates_text_extended": "Monetiza tu audiencia. Añade tus enlaces de afiliado externos (hasta 10) y comparte los productos de nuestros vendedores para ganar comisiones. Herramientas sencillas para ingresos pasivos y seguimiento en tiempo real.",

    "pricing_title": "Planes para Cada Ambición",
    "pricing_subtitle": "Ya sea que estés empezando o seas un vendedor consolidado, tenemos el plan adecuado para ti. Cancela en cualquier momento.",
    "plan_free_name": "Descubrimiento",
    "plan_free_price": "0€",
    "plan_free_period": "de por vida",
    "plan_free_feature_1": "Acceso al marketplace",
    "plan_free_feature_2": "Programa de referidos",
    "plan_free_feature_3": "Soporte por correo electrónico",
    "plan_free_cta": "Comenzar Gratis",
    "plan_seller_name": "Vendedor Pro",
    "plan_seller_price": "25€",
    "plan_seller_period": "/mes",
    "plan_seller_feature_1": "Tienda online completa",
    "plan_seller_feature_2": "Gestión de productos ilimitada",
    "plan_seller_feature_3": "Panel de control avanzado",
    "plan_seller_feature_4": "Red de afiliados",
    "plan_seller_cta": "Elegir Vendedor Pro",
    "plan_affiliate_name": "Afiliado Premium",
    "plan_affiliate_price": "10€",
    "plan_affiliate_period": "/mes",
    "plan_affiliate_feature_1": "Acceso a todos los productos",
    "plan_affiliate_feature_2": "Comisiones aumentadas",
    "plan_affiliate_feature_3": "Herramientas de promoción exclusivas",
    "plan_affiliate_feature_4": "Retiro de ganancias por referidos",
    "plan_affiliate_cta": "Convertirse en Afiliado Premium",

    "referral_title": "Gana Más con Referidos",
    "referral_text_1": "Invita a tus amigos, colegas y tu audiencia a unirse a JEOAH\'S. Por cada grupo de 25 referidos que se suscriban a un plan de pago, ganas una comisión del 10%.",
    "referral_text_2": "Copia tu enlace único y comienza a construir tu red hoy.",
    "referral_cta_placeholder": "Tu enlace de referido aparecerá aquí...",
    "referral_cta_button": "Copiar Enlace",
    
    "faq_title": "Preguntas Frecuentes",
    "faq_subtitle": "¿Tienes preguntas? Tenemos las respuestas.",
    "faq_1_q": "¿Qué es JEOAH\'S exactamente?",
    "faq_1_a": "JEOAH\'S es una plataforma todo en uno que sirve como un ecosistema para vendedores, afiliados y compradores. Los vendedores pueden crear su propia tienda en línea, los afiliados pueden promocionar productos para ganar comisiones y los compradores pueden descubrir productos de confianza en un solo lugar.",
    "faq_2_q": "¿Tengo que pagar para registrarme?",
    "faq_2_a": "¡Registrarse en JEOAH\'S es gratis! Puedes crear una cuenta, explorar la plataforma y participar en el programa de referidos sin una suscripción. Se requiere una suscripción de pago para desbloquear las funciones de venta (para vendedores) y para retirar las comisiones por referidos.",
    "faq_3_q": "¿Cómo funciona el programa de referidos?",
    "faq_3_a": "Cada miembro recibe un enlace de referido único. Cuando refieres a nuevos usuarios y un grupo de 25 de ellos se suscribe a un plan de pago, ganas una comisión del 10%. Para retirar tus ganancias, debes tener una suscripción activa, pero puedes comenzar a acumular referidos desde el momento en que te registras gratis.",
    "faq_4_q": "¿Qué tipos de productos puedo vender?",
    "faq_4_a": "Puedes vender una amplia variedad de productos, tanto físicos como digitales. Te pedimos que cumplas con nuestros términos de uso con respecto a los productos prohibidos. La flexibilidad es el núcleo de nuestra plataforma para permitir que cada vendedor encuentre su mercado.",
    "faq_5_q": "¿Cómo me pagan como afiliado o vendedor?",
    "faq_5_a": "Los pagos de las ventas y comisiones se procesan a través de plataformas seguras como Stripe y PayPal. Puedes configurar tus preferencias de pago en tu panel de control y seguir todos tus ingresos en tiempo real.",
    
    "footer_all_rights_reserved": "© 2025 JEOAH\'S. Todos los derechos reservados.",
    "footer_terms": "Términos de servicio",
    "footer_privacy": "Política de privacidad",
    
    "auth_title": "Crea tu cuenta",
    "auth_subtitle": "Elige tu rol para comenzar.",
    "auth_role_buyer": "Comprador",
    "auth_role_seller": "Vendedor",
    "auth_role_affiliate": "Afiliado",
    "auth_google_button": "Continuar con Google",
    "auth_terms_prefix": "Al continuar, aceptas nuestros",
    "auth_terms_link": "Términos",
    
    "contact_title": "Contáctenos",
    "contact_subtitle": "¿Una pregunta? ¿Una sugerencia? No lo dude.",
    "contact_name_label": "Nombre completo",
    "contact_email_label": "Dirección de correo electrónico",
    "contact_message_label": "Mensaje",
    "contact_send_button": "Enviar Mensaje",
    
    "dashboard_title": "Panel de Control",
    "dashboard_greeting": "Hola",
    "dashboard_billing_link": "Facturación",
    "dashboard_logout_button": "Cerrar sesión",
    "dashboard_loader_text": "Cargando tu espacio...",
    "dashboard_seller_title": "Añadir un nuevo producto",
    "dashboard_affiliate_title": "Tus Enlaces",

    "onboarding_links_title": "Añade Tus Enlaces de Afiliado",
    "onboarding_links_subtitle": "Introduce hasta 10 de tus enlaces de afiliado externos (ej: Amazon, AliExpress...). Esto nos ayuda a entender los productos que te gustan.",
    "onboarding_links_add_button": "Añadir otro enlace",
    "onboarding_next_step": "Siguiente Paso",

    "about_title": "Nuestra Misión: Conectar y Simplificar",
    "about_subtitle": "En JEOAH\'S, creemos en el poder de la conexión. Nuestro objetivo es crear el ecosistema más simple y potente para los emprendedores de la web.",
    "about_paragraph_1": "JEOAH\'S nació de una simple observación: las herramientas para vender en línea, promocionar productos o simplemente comprar con confianza están dispersas, son complejas y a menudo costosas. Quisimos crear una solución única que reúna a todos: los creadores de productos, los que tienen una audiencia y los que buscan productos de calidad.",
    "about_paragraph_2": "Nuestra plataforma está diseñada para ser intuitiva, flexible y potente. Ya seas un vendedor que lanza su primera tienda, un afiliado que busca monetizar su contenido o un comprador en busca de descubrimientos, JEOAH\'S te da las herramientas para triunfar, sin la complejidad técnica.",
    "about_paragraph_3": "Somos más que solo tecnología. Somos una comunidad. Al unirte a JEOAH\'S, entras en una red de apoyo mutuo donde el crecimiento de cada uno beneficia a todos. Bienvenido a la aventura.",

    "showcase_title": "La Vitrina JEOAH\'S",
    "showcase_subtitle": "Descubre los productos únicos de nuestra comunidad de vendedores y afiliados."
}
